use polars::prelude::*;
use anyhow::Result;

/*
Parquetの読み取り。ロード時の型などの確認
⇒型まで保存できるので一時保存には便利
*/

const LOAD_PARQUET_PATH:&str = "D:/data/processed/240903_m3_9_displacement/07_make_processed.parquet";


fn main() -> Result<()>{
    let mut file = std::fs::File::open(LOAD_PARQUET_PATH)?;
    let df = ParquetReader::new(&mut file).finish()?;

    println!("{}",df );

    Ok(())
}

/*
shape: (4_251, 2)
┌─────────────────────────┬───────────┐
│ datetime                ┆ deviation │
│ ---                     ┆ ---       │
│ datetime[ms]            ┆ i32       │
╞═════════════════════════╪═══════════╡
│ 2024-08-27 12:05:24     ┆ -355      │
│ 2024-08-27 12:05:24.600 ┆ -262      │
│ 2024-08-27 12:05:25.200 ┆ -310      │
│ 2024-08-27 12:05:25.800 ┆ -262      │
│ 2024-08-27 12:05:26.400 ┆ -334      │
│ …                       ┆ …         │
│ 2024-08-27 12:47:56.100 ┆ -668      │
│ 2024-08-27 12:47:56.700 ┆ -725      │
│ 2024-08-27 12:47:57.300 ┆ -650      │
│ 2024-08-27 12:47:57.900 ┆ -701      │
│ 2024-08-27 12:47:58.500 ┆ -710      │
└─────────────────────────┴───────────┘
*/